import 'package:flutter/material.dart';

class data {
  static List name = [
    "शुभकमनाये शायरी",
    "दोस्ती शायरी",
    "मजेदार शायरी",
    "भगवान शायरी",
    "पेरना सतरोत शायरी",
    "जीवन शायरी",
    "महोब्बत शायरी",
    "याद शायरी",
    "अन्य शायरी",
    "रजनीति शायरी",
  ];

  static List img = [
    "bestwishesh.png",
    "boyfriendgirl.png",
    "child.png",
    "god.png",
    "kanjoos.png",
    "married.png",
    "motivational.png",
    "officework.png",
    "politics.png",
    "santabanta.png",
    "expand.png",
    "pencil2.png",
    "reload.png",
  ];

  static List sha1 = [
    ''''मत मुस्कुराओ इतना की फूलो को खबर लग जाये
    हम करें आपकी तारीफ और आपको नजर लग जाये
    खुदा करे बहुत लम्बी हो आपकी जिंदगी
    और उस पर भी हमारी उम्र लग जाये…'''
        '',
    "वक्त की यारी तो हर कोई करता है मेरे दोस्त, मजा तो तब है जब वक्त बदले पर यार ना बदले.",
    ''''ना इश्क़ करो झूठा, ना प्यार करो फर्जी,

  आगे नहीं बताऊंगा, मेरा शेर मेरी मर्ज़ी!!''',
    '''हे ऊपरवाले थोडी महिमा दिखा दे

  जो reply  ना दे उसके फोन का Display  उड़ा दे''',
    '''ज़िंदगी ने दिए हैं बहुत से धोखे

  but

  कोई बात नहीं its ok''',
    '''ज़िन्दगी भर हम खुशियां ढूंढते रह गए
  बहार खुशी को ढूंढना के चक्कर में
  हम अपने अंदर की खुशी से वंचित रह गए''',
    '''कुछ कही, कुछ अनकही
  कुछ ख्वाहिशें मेरी
  ज़िन्दगी भर अधुरी रही''',
  ];

  static List sha2 = [
    "वो वफ़ा करे ना करे जिन्दगी अब उसी के नाम है…!!! किसी ने कसर नही छोड़ी दिल दुखाने में…!!! अगर वो ” हाँ ” कह दे तो कसम से मोहब्बत छोड़ दूँगा…!!! आप याद आयोगी कभी कभी तो पि लिया करेंगे…!!!",
    '''
  हर पल महसूस होते हो ,
  अब चाहे इसे याद कह लो।''',
    """तुम्हारे बिन भीगने की 
  मर गयी है ख्वाहिश,
  अब काटो-सी लगती है
  ये खूबसूरत बारिश।"""
  ];

  static List sh3 = [
    """दौलत की चाह थी तो कमाने निकल गए,
दौलत मिली तो हाथ से रिश्ते निकल गए,
बच्चों के साथ रहने की फुर्सत न मिल सकी,
फुर्सत मिली तो बच्चे ही घर निकल गए।""",
    """फ़िज़ा में ज़हर भरा है जरा संभल कर चलो,
मुखालिफ आज हवा है जरा संभल कर चलो,
कोई देखे न देखे बुराइयां अपनी,
खुदा तो देख रहा है जरा संभल कर चलो।

""",
    """फलसफा समझो न असरारे सियासत समझो,
जिन्दगी सिर्फ हकीक़त है हकीक़त समझो,
जाने किस दिन हो हवायें भी नीलाम यहाँ,
आज तो साँस भी लेते हो ग़नीमत समझो।

""",
    """समझने ही नहीं देती सियासत हम को सच्चाई,
कभी चेहरा नहीं मिलता कभी दर्पन नहीं मिलता।""",
    """जो तीर भी आता वो खाली नहीं जाता,
मायूस मेरे दिल से सवाली नहीं जाता,
काँटे ही किया करते हैं फूलों की हिफाज़त,
फूलों को बचाने कोई माली नहीं जाता।""",
  ];

  static List sh4 = [
    """अब ना मैं हूँ, ना बाकी हैं ज़माने मेरे​,
फिर भी मशहूर हैं शहरों में फ़साने मेरे​,
ज़िन्दगी है तो नए ज़ख्म भी लग जाएंगे​,
अब भी बाकी हैं कई दोस्त पुराने मेरे।""",
    """रोज़ तारों को नुमाइश में ख़लल पड़ता है,
चाँद पागल है अँधेरे में निकल पड़ता है,
रोज़ पत्थर की हिमायत में ग़ज़ल लिखते हैं,
रोज़ शीशों से कोई काम निकल पड़ता है।""",
    """बस इतनी सी बात पर हमारा परिचय तमाम होता है,
हम उस रास्ते नही जाते जो रास्ता आम होता है…........!!!""",
    """ये मत समझ कि तेरे काबिल नहीं हैं हम,
तड़प रहे हैं वो जिसे हासिल नहीं हैं हम.....!!!""",
    """आग लगाना मेरी फितरत में नही है,
मेरी सादगी से लोग जलें तो मेरा क्या कसूर......!!!""",
  ];

  static List sh5 = [
    """लाख तलवारे बढ़ी आती हों गर्दन की तरफ,
सर झुकाना नहीं आता तो झुकाए कैसे.........!!!""",
    """राज तो हमारा हर जगह पे है,
पसंद करने वालों के "दिल" में और,
नापसंद करने वालों के "दिमाग" में.......!!!""",
    """मैं लोगों से मुलाकातों के लम्हें याद रखता हूँ,
बातें भूल भी जाऊं पर लहजे याद रखता हूँ.....!!!""",
    """समंदर बहा देने का जिगर तो रखते हैं लेकिन,
हमें आशिकी की नुमाइश की आदत नहीं है दोस्त......!!!""",
    """मेरे बारे में अपनी सोच को थोड़ा बदल के देख,
मुझसे भी बुरे हैं लोग तू घर से निकल के देख.....!!!""",
  ];
  static List sh6 = [
    """बिना तेरे शहर का शहर वीरान रहता है,
बिछड़ के तुझसे हर रास्ता सुनसान रहता है,
वो तुझे तुझसे ज़्यादा प्यार करता है,
जो तेरे सामने अक्सर अंजान रहता है।
""",
    '''दुख में खुशी की वजह बनती है मोहब्बत,
  दर्द में यादों की वजह बनती है मोहब्बत,
  जब कुछ भी अच्छा नहीं लगे दुनिया में,
  उस वक्त जीने की वजह बनती है मोहब्बत।'''
  ];
  static List sh7 = [
    """चुप-चाप से रहते हैं वो अक्सर,
ज़ुल्फ़ें भी सुना है कि संवारा नहीं करते,
दिन रात गुजरते हैं उनके बेचैन से,
तो चैन से हम भी गुजारा नहीं करते।""",
    """
आरज़ू के दीए दिल में जलते रहेंगे,
मेरी आँखों से आंसू निकलते रहेंगे,
दिल में रौशनी तो करो तुम शमा बन के,
मोम बनकर हम यूं ही पिघलते रहेंगे।"""
  ];
  static List sh8 = [
    """
   बहुत खफा थे कि लहजा बदल गया मेरा,
उन्हीं के लहजे में उनसे जब बात की मैंने।
""",
    """
   एक दस्तक पे वो दरवाज़ा नहीं खोलेगा,
उसे मालूम जो है कि मैंने खड़े रहना है।
"""
  ];
  static List sh9 = [
    """
   अरमान तमाम उम्र के सीने में दफन हैं,
हम चलते फिरते लोग मजारों से कम नहीं।""",
    """तुमको याद रखने में मैं क्या-क्या भूल जाता हूँ,
जो दिल में बात हैं तुमको बताना भूल जाता हूँ,
तुम्हारे लब को छूने का इरादा रोज करता हूँ,
नजर तुमसे जो मिल जाये ज़माना भूल जाता हूँ।
   """
  ];

  static List sh10 = [
    """
   कठपुतली बेजुबान ही सही लेकिन उसके किरदारों को पूरी दुनिया महसूस करती है।""",
    """
     खुद को खुद के बारे में थोड़ा बता दो ना, अब आप भी आपने ज़िंदगी का फैसला लेना शुरू कर दो ना।"""
  ];

  static List color = [
    Colors.red,
    Colors.black,
    Colors.yellow,
    Colors.teal,
    Colors.blue,
    Colors.green,
    Colors.grey,
    Colors.orange,
    Colors.pink,
    Colors.deepPurple,
    Colors.purple,
    Colors.indigo,
    Colors.tealAccent,
    Colors.brown,
    Colors.cyan,
  ];

  static List emoji = [
    "😀 😃 😄",
    " 😁 😆 😅 😂",
    "😂 🤣 🥲 ",
    "🥹 ☺️ 😊 😇",
    "🙃 😉 😌 ",
    "😍 🥰 😘 😗",
    "😙 😚 😋",
    " 😛 😝 😜 🤪",
    "☹️ 😣 😖 😫",
    " 😩 🥺 😢",
    "😭 😮‍💨 😤 ",
    "😠 😡 🤬 🤯",
  ];
}
